{
  "procedures": [
    {
      "procedure_name": "Coronary Angioplasty with Stent Placement",
      "cpt_code": "92928",
      "icd10_pcs_code": "02703ZZ",
      "category": "Cardiovascular",
      "description": "A minimally invasive, percutaneous procedure to open narrowed or blocked coronary arteries. A catheter with a deflated balloon is guided to the site of the blockage under fluoroscopic guidance. The balloon is inflated, compressing the atherosclerotic plaque against the arterial wall. A coronary stent (a small, mesh-like metal tube) is then expanded and deployed at the site to act as a scaffold, maintaining vessel patency and improving blood flow to the heart muscle. Drug-eluting stents are commonly used to release medication that prevents restenosis.",
      "indications": ["Acute Myocardial Infarction (Heart Attack)", "Stable Angina Pectoris unresponsive to medical therapy", "Unstable Angina", "Positive cardiac stress test indicating significant ischemia", "High-grade coronary artery stenosis (>70%) identified on coronary angiography"],
      "contraindications": ["Lack of patient consent", "Non-correctable coagulopathy", "Intolerance to antiplatelet therapy", "Diffuse disease not amenable to stenting", "Unprotected left main coronary artery disease (in some cases, now treated with PCI)"],
      "technique": "Percutaneous Transluminal Coronary Angioplasty (PTCA) with intracoronary stent deployment. Typically performed via femoral or radial artery access.",
      "anesthesia_type": "Local anesthesia with conscious sedation",
      "duration": "60-120 minutes",
      "complications": ["Access site bleeding or hematoma", "Coronary artery dissection", "Stent thrombosis", "Contrast-induced nephropathy", "Arrhythmias", "Stroke", "Allergic reaction to contrast dye", "Emergency Coronary Artery Bypass Grafting (CABG) required", "Restenosis (in-stent)"],
      "recovery_time": "Inpatient: 1-2 days. Full recovery: 1-2 weeks for sedentary work; 4-6 weeks for strenuous activity.",
      "success_rate": ">95% for procedural success; 90-95% freedom from major adverse cardiac events at 1 year with drug-eluting stents.",
      "alternative_procedures": ["Coronary Artery Bypass Grafting (CABG)", "Optimal Medical Therapy (OMT) with anti-anginal medications", "Enhanced External Counterpulsation (EECP) for refractory angina"],
      "patient_instructions": ["Dual antiplatelet therapy (DAPT) with Aspirin and a P2Y12 inhibitor (e.g., Clopidogrel, Ticagrelor) is mandatory for a minimum of 6-12 months to prevent stent thrombosis. Never stop these medications without consulting your cardiologist. Monitor the access site for bleeding, swelling, or pain. Maintain hydration to protect kidneys from contrast dye. Attend all follow-up appointments. Report any recurrence of chest pain, shortness of breath, or bleeding immediately."]
    },
    {
      "procedure_name": "Laparoscopic Cholecystectomy",
      "cpt_code": "47562",
      "icd10_pcs_code": "0FT44ZZ",
      "category": "General Surgery",
      "description": "A minimally invasive surgical procedure to remove a diseased or inflamed gallbladder. Several small incisions (0.5-1 cm) are made in the abdomen. A laparoscope (a thin tube with a camera) is inserted through one incision, providing a magnified view of the internal organs on a monitor. Specialized instruments are inserted through the other ports to dissect the gallbladder from the liver bed, clip and transect the cystic duct and artery, and remove the gallbladder through one of the ports. It is the gold standard treatment for symptomatic gallstone disease.",
      "indications": ["Symptomatic Cholelithiasis (gallstones causing biliary colic)", "Acute Cholecystitis", "Gallstone Pancreatitis", "Biliary Dyskinesia", "Gallbladder Polyps >1cm", "Porcelain Gallbladder"],
      "contraindications": ["Uncorrectable coagulopathy", "Generalized peritonitis", "Suspected gallbladder carcinoma", "Late-stage pregnancy", "Severe cardiopulmonary disease prohibiting pneumoperitoneum", "Dense adhesions from previous surgery (relative)"],
      "technique": "Minimally invasive laparoscopy using 4 abdominal ports. The critical view of safety must be achieved before transecting any structures. Intraoperative cholangiography may be performed to delineate biliary anatomy.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-90 minutes",
      "complications": ["Bile leak", "Bile duct injury (e.g., transection of common bile duct)", "Bleeding", "Infection", "Bowel injury", "Retained common bile duct stones", "Port-site hernia", "Conversion to open laparotomy"],
      "recovery_time": "Outpatient or 23-hour observation. Return to normal activities: 1 week. Full recovery: 2-3 weeks. Avoid heavy lifting for 6 weeks.",
      "success_rate": ">99% for successful removal. Bile duct injury rate: 0.1-0.5%.",
      "alternative_procedures": ["Open Cholecystectomy", "Medical dissolution therapy with Ursodeoxycholic acid (for small cholesterol stones only)", "Extracorporeal Shock Wave Lithotripsy (rarely used)"],
      "patient_instructions": ["Diet: Start with clear liquids and advance to a low-fat diet as tolerated. Keep incision sites clean and dry. Expect some shoulder pain from residual CO2 gas, which will resolve in 24-48 hours. Watch for signs of infection (fever, redness, pus at incisions) or bile leak (worsening abdominal pain, jaundice, clay-colored stools). Follow up with your surgeon in 2-3 weeks."]
    },
    {
      "procedure_name": "Total Hip Arthroplasty",
      "cpt_code": "27130",
      "icd10_pcs_code": "0SR90J9",
      "category": "Orthopedic",
      "description": "A major surgical procedure to replace a damaged or arthritic hip joint with a prosthetic implant. The procedure involves removing the femoral head and acetabular cartilage, and replacing them with artificial components. The acetabular component is a metal shell with a plastic liner, and the femoral component consists of a metal stem with a ceramic or metal ball. The implants can be cemented into place or press-fit for biological fixation. Approaches include posterior, anterior, and lateral, each with different recovery profiles.",
      "indications": ["Severe Osteoarthritis", "Rheumatoid Arthritis", "Avascular Necrosis of the femoral head", "Hip fracture (e.g., femoral neck fracture in elderly)", "Congenital Hip Dysplasia with secondary arthritis"],
      "contraindications": ["Active local or systemic infection", "Severe peripheral vascular disease", "Neuropathic joint", "Paralysis of muscles around the hip", "Extreme skeletal immaturity"],
      "technique": "Surgical replacement of the hip joint via a chosen approach (e.g., Direct Anterior Approach, Posterolateral Approach). Components are sized and positioned to restore biomechanics and leg length.",
      "anesthesia_type": "General anesthesia or Spinal/Epidural anesthesia",
      "duration": "90-150 minutes",
      "complications": ["Prosthetic joint infection", "Deep Vein Thrombosis (DVT) / Pulmonary Embolism (PE)", "Dislocation", "Nerve or blood vessel injury", "Leg length discrepancy", "Implant loosening or wear over time", "Heterotopic ossification", "Periprosthetic fracture"],
      "recovery_time": "Inpatient: 1-3 days. Gait training with physical therapy begins immediately. Use of walker/cane for 4-6 weeks. Full recovery with strengthening: 3-6 months.",
      "success_rate": ">95% patient satisfaction at 10 years. Implant survivorship: >90% at 15-20 years.",
      "alternative_procedures": ["Hip Resurfacing Arthroplasty", "Hip Fusion (Arthrodesis)", "Osteotomy", "Conservative management (physical therapy, NSAIDs, activity modification, injections)"],
      "patient_instructions": ["STRICT adherence to hip precautions for 6-12 weeks (no bending past 90 degrees, no crossing legs, no internal rotation) to prevent dislocation. Use assistive devices as directed. Attend all physical and occupational therapy sessions. Complete the prescribed course of anticoagulation to prevent blood clots. Monitor incision for signs of infection (redness, swelling, drainage, fever). Long-term: avoid high-impact activities to prolong implant life."]
    },
    {
      "procedure_name": "Colonoscopy with Polypectomy",
      "cpt_code": "45385",
      "icd10_pcs_code": "0DJD8ZZ",
      "category": "Gastroenterology",
      "description": "An endoscopic procedure that allows for the direct visualization of the entire lining of the colon (large intestine) and terminal ileum using a flexible, lighted tube called a colonoscope. The scope is inserted through the rectum and advanced to the cecum. Air or CO2 is insufflated to distend the colon for better visualization. The procedure is both diagnostic and therapeutic. If pre-cancerous growths (polyps) are identified, they can be removed (polypectomy) using specialized tools passed through the scope, such as snares or biopsy forceps. This is a primary tool for colorectal cancer screening and prevention.",
      "indications": ["Colorectal Cancer Screening (average risk starting at age 45)", "Evaluation of positive Fecal Immunochemical Test (FIT) or Cologuard", "Iron Deficiency Anemia", "Hematochezia (bright red blood per rectum) or Melena", "Chronic Diarrhea", "Surveillance in patients with personal history of polyps or cancer", "Inflammatory Bowel Disease assessment", "Abdominal pain of unknown origin"],
      "contraindications": ["Suspected bowel perforation", "Acute severe diverticulitis or colitis", "Toxic megacolon", "Recent myocardial infarction or unstable cardiopulmonary status", "Uncooperative patient"],
      "technique": "Flexible video colonoscopy with conscious sedation. Polypectomy techniques include cold forceps, cold snare, hot snare, or endoscopic mucosal resection (EMR) for larger lesions.",
      "anesthesia_type": "Conscious sedation (e.g., Midazolam and Fentanyl) or Monitored Anesthesia Care (MAC/Propofol)",
      "duration": "30-60 minutes (longer if multiple or complex polyps are removed)",
      "complications": ["Perforation (<0.1%)", "Post-polypectomy bleeding (1-2%)", "Adverse reaction to sedation", "Transient abdominal bloating and discomfort", "Incomplete procedure due to poor preparation or anatomy"],
      "recovery_time": "Same-day procedure. Recovery from sedation: 1-2 hours. Resume normal diet and activities the next day.",
      "success_rate": ">95% for cecal intubation. High efficacy in detecting and preventing colorectal cancer.",
      "alternative_procedures": ["CT Colonography (Virtual Colonoscopy)", "Flexible Sigmoidoscopy", "Fecal Immunochemical Test (FIT)", "Stool DNA Test (Cologuard)", "Capsule Endoscopy (for small bowel, not colon)"],
      "patient_instructions": ["The most important part is the PREP. Adhere strictly to the bowel preparation instructions to ensure a clean colon for adequate visualization. Arrange for a driver to take you home due to sedation. After the procedure, you may have gas and bloating. Resume normal diet unless instructed otherwise. Report severe abdominal pain, fever, or significant rectal bleeding (more than a few tablespoons) immediately. Follow up for pathology results on any biopsies or polyps removed."]
    },
    {
      "procedure_name": "Cataract Extraction with Intraocular Lens Implant",
      "cpt_code": "66984",
      "icd10_pcs_code": "08SJXZZ",
      "category": "Ophthalmology",
      "description": "A highly common and successful ophthalmic surgery to remove the eye's clouded natural lens (cataract) and replace it with a clear, artificial intraocular lens (IOL). The procedure is typically performed using phacoemulsification: a small corneal incision is made, a circular opening is created in the lens capsule (capsulorhexis), and an ultrasonic probe is used to break the cloudy lens into tiny pieces, which are then aspirated. The folded IOL is then inserted through the small incision and unfolded into the empty capsular bag, where it remains permanently. The IOL power is calculated pre-operatively to reduce dependence on glasses.",
      "indications": ["Visual impairment due to cataracts affecting activities of daily living (driving, reading)", "Cataract causing glare disability", "Lens-induced glaucoma or phacomorphic angle closure", "Need for improved fundoscopic view to manage retinal disease (e.g., diabetic retinopathy)"],
      "contraindications": ["Active ocular infection (e.g., conjunctivitis, keratitis)", "Uncontrolled inflammation (e.g., uveitis)", "Advanced glaucoma with poor visual potential", "Microphthalmos or other severe anatomical anomalies"],
      "technique": "Phacoemulsification through a clear corneal incision. Continuous curvilinear capsulorhexis, hydrodissection, phacoemulsification, irrigation/aspiration of cortex, and IOL implantation into the capsular bag.",
      "anesthesia_type": "Topical anesthetic drops with or without intravenous sedation",
      "duration": "15-20 minutes per eye",
      "complications": ["Posterior capsule opacification (common, treatable with YAG laser)", "Endophthalmitis (serious infection, <0.1%)", "Retinal detachment", "Cystoid Macular Edema", "Corneal edema", "Dropped nucleus", "Refractive error ( residual nearsightedness/farsightedness)"],
      "recovery_time": "Outpatient procedure. Vision is blurry initially but improves over days to weeks. Full stabilization: 4-8 weeks.",
      "success_rate": ">98% success rate with significant improvement in visual acuity. One of the safest and most effective surgeries performed.",
      "alternative_procedures": ["Observation with updated glasses prescription if symptoms are mild", "Laser surgery (not for cataract removal, but for secondary opacification)"],
      "patient_instructions": ["Use prescribed antibiotic and anti-inflammatory eye drops exactly as directed for several weeks. Wear the protective shield while sleeping for the first week. Avoid rubbing, pressing, or getting water in the eye for 1-2 weeks. Avoid strenuous activity and swimming for 2-4 weeks. Attend all post-operative visits. Expect some glare and fluctuating vision initially. New glasses prescription will be given once the eye has fully healed (around 1 month)."]
    },
    {
      "procedure_name": "Lumbar Laminectomy",
      "cpt_code": "63047",
      "icd10_pcs_code": "00S90ZZ",
      "category": "Neurosurgery / Orthopedic Spine",
      "description": "A decompressive spinal surgery performed to relieve pressure on the spinal cord or nerve roots in the lumbar spine. The procedure involves removing the lamina (the bony roof of the spinal canal) and often a portion of the thickened ligamentum flavum. This enlargement of the spinal canal creates more space for the neural elements, alleviating symptoms caused by stenosis, such as pain, numbness, and weakness that radiates into the buttocks and legs (neurogenic claudication). It may be performed with or without spinal fusion.",
      "indications": ["Lumbar Spinal Stenosis with neurogenic claudication unresponsive to conservative care", "Herniated Nucleus Pulposus with radiculopathy", "Spondylolisthesis with associated stenosis", "Spinal tumors or infections causing compression"],
      "contraindications": ["Mild symptoms manageable with non-surgical treatment", "Axial back pain without leg symptoms", "Medical comorbidities making anesthesia high-risk", "Active systemic infection"],
      "technique": "Open or minimally invasive technique. An incision is made midline over the lumbar spine. Muscles are retracted, the lamina is identified and removed, and any compressive lesions (disc fragments, hypertrophic ligament) are resected.",
      "anesthesia_type": "General anesthesia",
      "duration": "90-180 minutes",
      "complications": ["Dural tear (CSF leak)", "Nerve root injury", "Bleeding/hematoma", "Infection", "Instability requiring future fusion", "Recurrent stenosis or disc herniation", "Failed back surgery syndrome (chronic pain)"],
      "recovery_time": "Inpatient: 1-3 days. Walking is encouraged immediately. Return to sedentary work: 2-4 weeks. Full recovery with physical therapy: 3-6 months. No heavy lifting for 3-6 months.",
      "success_rate": "70-80% success rate for relieving leg pain. Less reliable for relieving axial back pain alone.",
      "alternative_procedures": ["Laminotomy (partial removal)", "Microdiscectomy", "Interspinous process spacers", "Comprehensive non-surgical management (physical therapy, epidural steroid injections, medications)"],
      "patient_instructions": ["Incision care: keep clean and dry. No soaking in baths/pools. Log-roll technique to get in/out of bed to avoid twisting. Avoid bending at the waist and lifting anything heavier than 5-10 lbs for the first 6 weeks. Begin walking as tolerated; it is the best exercise. Attend prescribed physical therapy. Report signs of infection (fever, redness/drainage from incision) or new/worsening neurological symptoms (leg weakness, bowel/bladder incontinence) immediately."]
    },
    {
      "procedure_name": "Total Abdominal Hysterectomy with Bilateral Salpingo-Oophorectomy",
      "cpt_code": "58150",
      "icd10_pcs_code": "0UT94ZZ",
      "category": "Gynecology",
      "description": "A major surgical procedure to remove the uterus (hysterectomy) through an abdominal incision, along with both fallopian tubes (salpingectomy) and both ovaries (oophorectomy). This is typically performed via a Pfannenstiel incision (a low transverse 'bikini line' incision) or, less commonly, a vertical midline incision. It is a definitive treatment for various gynecological conditions and provides surgical menopause if the ovaries are removed in a pre-menopausal woman.",
      "indications": ["Symptomatic Uterine Leiomyomas (Fibroids) causing bleeding, pain, or bulk symptoms", "Endometriosis refractory to medical management", "Gynecologic cancers (endometrial, ovarian, cervical)", "Pelvic organ prolapse", "Chronic pelvic pain of uterine origin", "Adenomyosis", "Prophylactic risk reduction in patients with BRCA mutations"],
      "contraindications": ["Desire for future fertility", "Medical instability for major surgery", "Placenta percreta or other conditions where an alternative approach (e.g., interventional radiology) is preferred"],
      "technique": "Open abdominal surgery. The uterus is detached from its supporting ligaments, blood vessels (uterine artery) are ligated, and it is separated from the cervix (if supracervical) or the entire uterus and cervix are removed (total hysterectomy). The ovaries and tubes are detached and removed.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-120 minutes",
      "complications": ["Hemorrhage", "Infection (wound, urinary tract)", "Injury to adjacent organs (bladder, ureter, bowel)", "Deep Vein Thrombosis (DVT)", "Adhesion formation", "Early menopause symptoms (if ovaries removed)", "Vaginal cuff dehiscence (if cervix removed)"],
      "recovery_time": "Inpatient: 2-4 days. Full recovery: 6-8 weeks. No heavy lifting or intercourse for 6-8 weeks.",
      "success_rate": "High success rate (>95%) for resolving the primary condition (e.g., bleeding from fibroids).",
      "alternative_procedures": ["Laparoscopic or Robotic-Assisted Hysterectomy", "Vaginal Hysterectomy", "Uterine Artery Embolization (for fibroids)", "Myomectomy (for fibroids, preserves uterus)", "Medical management (hormonal therapy for endometriosis/fibroids)"],
      "patient_instructions": ["Incision care as directed. No tampons, douching, or sexual intercourse for 6-8 weeks. Avoid heavy lifting (>10 lbs) and strenuous activity for 6 weeks. Expect vaginal bleeding/spotting for 1-2 weeks. Walk frequently to prevent blood clots. Report fever >100.4°F, severe abdominal pain, heavy vaginal bleeding, or signs of a leg clot (calf pain, redness, swelling) immediately. Discuss management of surgical menopausal symptoms (hot flashes, vaginal dryness) with your doctor."]
    },
    {
      "procedure_name": "Robotic-Assisted Radical Prostatectomy",
      "cpt_code": "55866",
      "icd10_pcs_code": "0VT08ZZ",
      "category": "Urology",
      "description": "A minimally invasive surgical procedure to remove the entire prostate gland and seminal vesicles for the treatment of localized prostate cancer. Utilizing the da Vinci Surgical System, the surgeon operates from a console, controlling robotic arms that hold miniature instruments and a high-definition 3D camera. This technology allows for enhanced precision, magnification, and dexterity in the confined space of the pelvis, facilitating nerve-sparing techniques that can help preserve urinary continence and erectile function.",
      "indications": ["Localized Prostate Cancer (low to intermediate risk)", "Selected cases of high-risk localized prostate cancer", "Failed primary radiation therapy"],
      "contraindications": ["Metastatic prostate cancer", "Medical comorbidities making extended anesthesia high-risk", "Prior complex pelvic surgery creating dense adhesions"],
      "technique": "Minimally invasive laparoscopy with robotic assistance. Typically performed transperitoneally. The prostate is dissected free, with careful preservation of the neurovascular bundles if possible, and the bladder neck is reconstructed to the urethra (vesicourethral anastomosis).",
      "anesthesia_type": "General anesthesia",
      "duration": "2-4 hours",
      "complications": ["Erectile Dysfunction", "Urinary Incontinence (stress or urge)", "Bladder neck contracture", "Rectal injury (rare)", "Lymphocele (if lymph node dissection performed)", "Blood loss requiring transfusion"],
      "recovery_time": "Inpatient: 1-2 days. Urinary catheter remains for 5-14 days. Return to light activities: 2-3 weeks. Full recovery: 6-8 weeks. Recovery of continence and erectile function can take 6-24 months.",
      "success_rate": "High oncologic success with 10-year cancer control >90% for low-risk disease. Continence rates: >90%. Potency rates vary widely (40-80%) based on age, pre-op function, and nerve-sparing success.",
      "alternative_procedures": ["Active Surveillance", "Radiation Therapy (External Beam or Brachytherapy)", "Cryotherapy", "High-Intensity Focused Ultrasound (HIFU)", "Open Radical Retropubic Prostatectomy"],
      "patient_instructions": ["Manage the urinary catheter; keep the bag below bladder level and clean the catheter site. Avoid strenuous activity and heavy lifting for 6 weeks. Perform Kegel exercises regularly to improve urinary control. Do not drive while the catheter is in place. Understand that incontinence and erectile dysfunction are common initially but often improve with time. Follow up for regular PSA checks to monitor for cancer recurrence."]
    },
    {
      "procedure_name": "Functional Endoscopic Sinus Surgery",
      "cpt_code": "31256",
      "icd10_pcs_code": "09BQ8ZZ",
      "category": "Otolaryngology (ENT)",
      "description": "A minimally invasive procedure performed entirely through the nostrils using an endoscope to visualize and access the paranasal sinuses. The goal is to restore normal sinus ventilation and drainage by removing obstructive tissues (diseased sinus mucosa, polyps) and enlarging the natural drainage pathways (ostiomeatal complex). No external incisions are made. It is primarily used to treat chronic sinusitis that has not responded to maximum medical therapy.",
      "indications": ["Chronic Rhinosinusitis with or without Nasal Polyps refractory to medical management", "Recurrent Acute Sinusitis", "Mucoceles", "Benign sinonasal tumors (e.g., inverted papilloma)", "Orbital or optic nerve decompression", "CSF leak repair", "Exposure for pituitary surgery"],
      "contraindications": ["Uncorrectable bleeding disorder", "Medical instability for general anesthesia", "Small child with underdeveloped sinuses"],
      "technique": "Endoscopic visualization. Use of micro-debriders, forceps, and balloons to open and clear the ethmoid, maxillary, frontal, and sphenoid sinuses.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-120 minutes",
      "complications": ["Bleeding", "Orbital injury (hematoma, extraocular muscle injury, blindness <0.1%)", "CSF Leak", "Epiphora (tearing) from nasolacrimal duct injury", "Synechiae (scar tissue) formation", "Recurrence of disease", "Altered sense of smell"],
      "recovery_time": "Outpatient or 23-hour observation. Significant nasal congestion/crusting for 1-3 weeks. Full mucosal healing: 4-6 weeks.",
      "success_rate": "85-90% success rate in significantly improving symptoms of chronic sinusitis.",
      "alternative_procedures": ["Continued medical therapy (nasal steroids, saline irrigations, antibiotics)", "Balloon Sinuplasty (limited applications)", "External/open sinus procedures (e.g., Caldwell-Luc, frontal sinus obliteration - now rare)"],
      "patient_instructions": ["SALINE IRRIGATIONS are crucial. Begin frequent irrigations as directed by your surgeon (often starting 24-48 hours post-op) to clear debris and blood clots and promote healing. Avoid blowing your nose forcefully for 2 weeks. Sneeze with your mouth open. Avoid strenuous activity and heavy lifting for 2 weeks. Expect bloody drainage and congestion. Attend all post-operative debridement appointments. Report severe bleeding, sharp eye pain, vision changes, or clear watery drainage from the nose (could be CSF leak) immediately."]
    },
    {
      "procedure_name": "Laparoscopic Appendectomy",
      "cpt_code": "44970",
      "icd10_pcs_code": "0DTJ4ZZ",
      "category": "General Surgery",
      "description": "The minimally invasive surgical standard for removing an inflamed or infected appendix (acute appendicitis). Three to four small incisions are made in the abdomen. A laparoscope is inserted to visualize the abdominal cavity. The appendix is identified, its mesentery (blood supply) is divided with a energy device, the appendix is stapled off at its base, and then it is removed through one of the ports, often placed in a specimen bag to prevent contamination. Laparoscopy allows for better visualization of the entire abdomen to rule out other pathology.",
      "indications": ["Acute Appendicitis", "Appendiceal Abscess (sometimes after drainage)", "Appendiceal tumor (e.g., carcinoid) found incidentally"],
      "contraindications": ["Generalized peritonitis with hemodynamic instability", "Dense adhesions from multiple previous surgeries", "Late-stage pregnancy (relative)", "Inability to tolerate pneumoperitoneum"],
      "technique": "Minimally invasive laparoscopy. The appendix is mobilized, its vascular pedicle is ligated, the base is transected, and it is removed.",
      "anesthesia_type": "General anesthesia",
      "duration": "30-60 minutes",
      "complications": ["Intra-abdominal abscess (more common in perforated appendicitis)", "Wound infection", "Bleeding", "Ileus", "Port-site hernia", "Stump appendicitis (very rare)"],
      "recovery_time": "Inpatient: 23 hours to 2 days. Return to normal activities: 1-2 weeks. Full recovery: 2-3 weeks.",
      "success_rate": ">99%. Conversion to open procedure occurs in <5% of cases, often for complex inflammation or adhesions.",
      "alternative_procedures": ["Open Appendectomy", "Non-operative management with IV antibiotics for uncomplicated appendicitis (may have higher recurrence rate)", "Percutaneous drainage of appendiceal abscess followed by interval appendectomy"],
      "patient_instructions": ["Diet: Advance from clear liquids to regular diet as tolerated. Keep incision sites clean and dry. Expect some shoulder tip pain from residual CO2 gas for 24-48 hours. Walk daily. Avoid heavy lifting for 4-6 weeks. Report fever, worsening abdominal pain, nausea/vomiting, or redness/drainage from incisions."]
    },
    {
      "procedure_name": "Coronary Angioplasty with Stent Placement",
      "cpt_code": "92928",
      "icd10_pcs_code": "02703ZZ",
      "category": "Cardiovascular",
      "description": "A minimally invasive, percutaneous procedure to open narrowed or blocked coronary arteries. A catheter with a deflated balloon is guided to the site of the blockage under fluoroscopic guidance. The balloon is inflated, compressing the atherosclerotic plaque against the arterial wall. A coronary stent (a small, mesh-like metal tube) is then expanded and deployed at the site to act as a scaffold, maintaining vessel patency and improving blood flow to the heart muscle. Drug-eluting stents are commonly used to release medication that prevents restenosis.",
      "indications": ["Acute Myocardial Infarction (Heart Attack)", "Stable Angina Pectoris unresponsive to medical therapy", "Unstable Angina", "Positive cardiac stress test indicating significant ischemia", "High-grade coronary artery stenosis (>70%) identified on coronary angiography"],
      "contraindications": ["Lack of patient consent", "Non-correctable coagulopathy", "Intolerance to antiplatelet therapy", "Diffuse disease not amenable to stenting", "Unprotected left main coronary artery disease (in some cases, now treated with PCI)"],
      "technique": "Percutaneous Transluminal Coronary Angioplasty (PTCA) with intracoronary stent deployment. Typically performed via femoral or radial artery access.",
      "anesthesia_type": "Local anesthesia with conscious sedation",
      "duration": "60-120 minutes",
      "complications": ["Access site bleeding or hematoma", "Coronary artery dissection", "Stent thrombosis", "Contrast-induced nephropathy", "Arrhythmias", "Stroke", "Allergic reaction to contrast dye", "Emergency Coronary Artery Bypass Grafting (CABG) required", "Restenosis (in-stent)"],
      "recovery_time": "Inpatient: 1-2 days. Full recovery: 1-2 weeks for sedentary work; 4-6 weeks for strenuous activity.",
      "success_rate": ">95% for procedural success; 90-95% freedom from major adverse cardiac events at 1 year with drug-eluting stents.",
      "alternative_procedures": ["Coronary Artery Bypass Grafting (CABG)", "Optimal Medical Therapy (OMT) with anti-anginal medications", "Enhanced External Counterpulsation (EECP) for refractory angina"],
      "patient_instructions": ["Dual antiplatelet therapy (DAPT) with Aspirin and a P2Y12 inhibitor (e.g., Clopidogrel, Ticagrelor) is mandatory for a minimum of 6-12 months to prevent stent thrombosis. Never stop these medications without consulting your cardiologist. Monitor the access site for bleeding, swelling, or pain. Maintain hydration to protect kidneys from contrast dye. Attend all follow-up appointments. Report any recurrence of chest pain, shortness of breath, or bleeding immediately."]
    },
    {
      "procedure_name": "Laparoscopic Cholecystectomy",
      "cpt_code": "47562",
      "icd10_pcs_code": "0FT44ZZ",
      "category": "General Surgery",
      "description": "A minimally invasive surgical procedure to remove a diseased or inflamed gallbladder. Several small incisions (0.5-1 cm) are made in the abdomen. A laparoscope (a thin tube with a camera) is inserted through one incision, providing a magnified view of the internal organs on a monitor. Specialized instruments are inserted through the other ports to dissect the gallbladder from the liver bed, clip and transect the cystic duct and artery, and remove the gallbladder through one of the ports. It is the gold standard treatment for symptomatic gallstone disease.",
      "indications": ["Symptomatic Cholelithiasis (gallstones causing biliary colic)", "Acute Cholecystitis", "Gallstone Pancreatitis", "Biliary Dyskinesia", "Gallbladder Polyps >1cm", "Porcelain Gallbladder"],
      "contraindications": ["Uncorrectable coagulopathy", "Generalized peritonitis", "Suspected gallbladder carcinoma", "Late-stage pregnancy", "Severe cardiopulmonary disease prohibiting pneumoperitoneum", "Dense adhesions from previous surgery (relative)"],
      "technique": "Minimally invasive laparoscopy using 4 abdominal ports. The critical view of safety must be achieved before transecting any structures. Intraoperative cholangiography may be performed to delineate biliary anatomy.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-90 minutes",
      "complications": ["Bile leak", "Bile duct injury (e.g., transection of common bile duct)", "Bleeding", "Infection", "Bowel injury", "Retained common bile duct stones", "Port-site hernia", "Conversion to open laparotomy"],
      "recovery_time": "Outpatient or 23-hour observation. Return to normal activities: 1 week. Full recovery: 2-3 weeks. Avoid heavy lifting for 6 weeks.",
      "success_rate": ">99% for successful removal. Bile duct injury rate: 0.1-0.5%.",
      "alternative_procedures": ["Open Cholecystectomy", "Medical dissolution therapy with Ursodeoxycholic acid (for small cholesterol stones only)", "Extracorporeal Shock Wave Lithotripsy (rarely used)"],
      "patient_instructions": ["Diet: Start with clear liquids and advance to a low-fat diet as tolerated. Keep incision sites clean and dry. Expect some shoulder pain from residual CO2 gas, which will resolve in 24-48 hours. Watch for signs of infection (fever, redness, pus at incisions) or bile leak (worsening abdominal pain, jaundice, clay-colored stools). Follow up with your surgeon in 2-3 weeks."]
    },
    {
      "procedure_name": "Total Hip Arthroplasty",
      "cpt_code": "27130",
      "icd10_pcs_code": "0SR90J9",
      "category": "Orthopedic",
      "description": "A major surgical procedure to replace a damaged or arthritic hip joint with a prosthetic implant. The procedure involves removing the femoral head and acetabular cartilage, and replacing them with artificial components. The acetabular component is a metal shell with a plastic liner, and the femoral component consists of a metal stem with a ceramic or metal ball. The implants can be cemented into place or press-fit for biological fixation. Approaches include posterior, anterior, and lateral, each with different recovery profiles.",
      "indications": ["Severe Osteoarthritis", "Rheumatoid Arthritis", "Avascular Necrosis of the femoral head", "Hip fracture (e.g., femoral neck fracture in elderly)", "Congenital Hip Dysplasia with secondary arthritis"],
      "contraindications": ["Active local or systemic infection", "Severe peripheral vascular disease", "Neuropathic joint", "Paralysis of muscles around the hip", "Extreme skeletal immaturity"],
      "technique": "Surgical replacement of the hip joint via a chosen approach (e.g., Direct Anterior Approach, Posterolateral Approach). Components are sized and positioned to restore biomechanics and leg length.",
      "anesthesia_type": "General anesthesia or Spinal/Epidural anesthesia",
      "duration": "90-150 minutes",
      "complications": ["Prosthetic joint infection", "Deep Vein Thrombosis (DVT) / Pulmonary Embolism (PE)", "Dislocation", "Nerve or blood vessel injury", "Leg length discrepancy", "Implant loosening or wear over time", "Heterotopic ossification", "Periprosthetic fracture"],
      "recovery_time": "Inpatient: 1-3 days. Gait training with physical therapy begins immediately. Use of walker/cane for 4-6 weeks. Full recovery with strengthening: 3-6 months.",
      "success_rate": ">95% patient satisfaction at 10 years. Implant survivorship: >90% at 15-20 years.",
      "alternative_procedures": ["Hip Resurfacing Arthroplasty", "Hip Fusion (Arthrodesis)", "Osteotomy", "Conservative management (physical therapy, NSAIDs, activity modification, injections)"],
      "patient_instructions": ["STRICT adherence to hip precautions for 6-12 weeks (no bending past 90 degrees, no crossing legs, no internal rotation) to prevent dislocation. Use assistive devices as directed. Attend all physical and occupational therapy sessions. Complete the prescribed course of anticoagulation to prevent blood clots. Monitor incision for signs of infection (redness, swelling, drainage, fever). Long-term: avoid high-impact activities to prolong implant life."]
    },
    {
      "procedure_name": "Colonoscopy with Polypectomy",
      "cpt_code": "45385",
      "icd10_pcs_code": "0DJD8ZZ",
      "category": "Gastroenterology",
      "description": "An endoscopic procedure that allows for the direct visualization of the entire lining of the colon (large intestine) and terminal ileum using a flexible, lighted tube called a colonoscope. The scope is inserted through the rectum and advanced to the cecum. Air or CO2 is insufflated to distend the colon for better visualization. The procedure is both diagnostic and therapeutic. If pre-cancerous growths (polyps) are identified, they can be removed (polypectomy) using specialized tools passed through the scope, such as snares or biopsy forceps. This is a primary tool for colorectal cancer screening and prevention.",
      "indications": ["Colorectal Cancer Screening (average risk starting at age 45)", "Evaluation of positive Fecal Immunochemical Test (FIT) or Cologuard", "Iron Deficiency Anemia", "Hematochezia (bright red blood per rectum) or Melena", "Chronic Diarrhea", "Surveillance in patients with personal history of polyps or cancer", "Inflammatory Bowel Disease assessment", "Abdominal pain of unknown origin"],
      "contraindications": ["Suspected bowel perforation", "Acute severe diverticulitis or colitis", "Toxic megacolon", "Recent myocardial infarction or unstable cardiopulmonary status", "Uncooperative patient"],
      "technique": "Flexible video colonoscopy with conscious sedation. Polypectomy techniques include cold forceps, cold snare, hot snare, or endoscopic mucosal resection (EMR) for larger lesions.",
      "anesthesia_type": "Conscious sedation (e.g., Midazolam and Fentanyl) or Monitored Anesthesia Care (MAC/Propofol)",
      "duration": "30-60 minutes (longer if multiple or complex polyps are removed)",
      "complications": ["Perforation (<0.1%)", "Post-polypectomy bleeding (1-2%)", "Adverse reaction to sedation", "Transient abdominal bloating and discomfort", "Incomplete procedure due to poor preparation or anatomy"],
      "recovery_time": "Same-day procedure. Recovery from sedation: 1-2 hours. Resume normal diet and activities the next day.",
      "success_rate": ">95% for cecal intubation. High efficacy in detecting and preventing colorectal cancer.",
      "alternative_procedures": ["CT Colonography (Virtual Colonoscopy)", "Flexible Sigmoidoscopy", "Fecal Immunochemical Test (FIT)", "Stool DNA Test (Cologuard)", "Capsule Endoscopy (for small bowel, not colon)"],
      "patient_instructions": ["The most important part is the PREP. Adhere strictly to the bowel preparation instructions to ensure a clean colon for adequate visualization. Arrange for a driver to take you home due to sedation. After the procedure, you may have gas and bloating. Resume normal diet unless instructed otherwise. Report severe abdominal pain, fever, or significant rectal bleeding (more than a few tablespoons) immediately. Follow up for pathology results on any biopsies or polyps removed."]
    },
    {
      "procedure_name": "Cataract Extraction with Intraocular Lens Implant",
      "cpt_code": "66984",
      "icd10_pcs_code": "08SJXZZ",
      "category": "Ophthalmology",
      "description": "A highly common and successful ophthalmic surgery to remove the eye's clouded natural lens (cataract) and replace it with a clear, artificial intraocular lens (IOL). The procedure is typically performed using phacoemulsification: a small corneal incision is made, a circular opening is created in the lens capsule (capsulorhexis), and an ultrasonic probe is used to break the cloudy lens into tiny pieces, which are then aspirated. The folded IOL is then inserted through the small incision and unfolded into the empty capsular bag, where it remains permanently. The IOL power is calculated pre-operatively to reduce dependence on glasses.",
      "indications": ["Visual impairment due to cataracts affecting activities of daily living (driving, reading)", "Cataract causing glare disability", "Lens-induced glaucoma or phacomorphic angle closure", "Need for improved fundoscopic view to manage retinal disease (e.g., diabetic retinopathy)"],
      "contraindications": ["Active ocular infection (e.g., conjunctivitis, keratitis)", "Uncontrolled inflammation (e.g., uveitis)", "Advanced glaucoma with poor visual potential", "Microphthalmos or other severe anatomical anomalies"],
      "technique": "Phacoemulsification through a clear corneal incision. Continuous curvilinear capsulorhexis, hydrodissection, phacoemulsification, irrigation/aspiration of cortex, and IOL implantation into the capsular bag.",
      "anesthesia_type": "Topical anesthetic drops with or without intravenous sedation",
      "duration": "15-20 minutes per eye",
      "complications": ["Posterior capsule opacification (common, treatable with YAG laser)", "Endophthalmitis (serious infection, <0.1%)", "Retinal detachment", "Cystoid Macular Edema", "Corneal edema", "Dropped nucleus", "Refractive error ( residual nearsightedness/farsightedness)"],
      "recovery_time": "Outpatient procedure. Vision is blurry initially but improves over days to weeks. Full stabilization: 4-8 weeks.",
      "success_rate": ">98% success rate with significant improvement in visual acuity. One of the safest and most effective surgeries performed.",
      "alternative_procedures": ["Observation with updated glasses prescription if symptoms are mild", "Laser surgery (not for cataract removal, but for secondary opacification)"],
      "patient_instructions": ["Use prescribed antibiotic and anti-inflammatory eye drops exactly as directed for several weeks. Wear the protective shield while sleeping for the first week. Avoid rubbing, pressing, or getting water in the eye for 1-2 weeks. Avoid strenuous activity and swimming for 2-4 weeks. Attend all post-operative visits. Expect some glare and fluctuating vision initially. New glasses prescription will be given once the eye has fully healed (around 1 month)."]
    },
    {
      "procedure_name": "Lumbar Laminectomy",
      "cpt_code": "63047",
      "icd10_pcs_code": "00S90ZZ",
      "category": "Neurosurgery / Orthopedic Spine",
      "description": "A decompressive spinal surgery performed to relieve pressure on the spinal cord or nerve roots in the lumbar spine. The procedure involves removing the lamina (the bony roof of the spinal canal) and often a portion of the thickened ligamentum flavum. This enlargement of the spinal canal creates more space for the neural elements, alleviating symptoms caused by stenosis, such as pain, numbness, and weakness that radiates into the buttocks and legs (neurogenic claudication). It may be performed with or without spinal fusion.",
      "indications": ["Lumbar Spinal Stenosis with neurogenic claudication unresponsive to conservative care", "Herniated Nucleus Pulposus with radiculopathy", "Spondylolisthesis with associated stenosis", "Spinal tumors or infections causing compression"],
      "contraindications": ["Mild symptoms manageable with non-surgical treatment", "Axial back pain without leg symptoms", "Medical comorbidities making anesthesia high-risk", "Active systemic infection"],
      "technique": "Open or minimally invasive technique. An incision is made midline over the lumbar spine. Muscles are retracted, the lamina is identified and removed, and any compressive lesions (disc fragments, hypertrophic ligament) are resected.",
      "anesthesia_type": "General anesthesia",
      "duration": "90-180 minutes",
      "complications": ["Dural tear (CSF leak)", "Nerve root injury", "Bleeding/hematoma", "Infection", "Instability requiring future fusion", "Recurrent stenosis or disc herniation", "Failed back surgery syndrome (chronic pain)"],
      "recovery_time": "Inpatient: 1-3 days. Walking is encouraged immediately. Return to sedentary work: 2-4 weeks. Full recovery with physical therapy: 3-6 months. No heavy lifting for 3-6 months.",
      "success_rate": "70-80% success rate for relieving leg pain. Less reliable for relieving axial back pain alone.",
      "alternative_procedures": ["Laminotomy (partial removal)", "Microdiscectomy", "Interspinous process spacers", "Comprehensive non-surgical management (physical therapy, epidural steroid injections, medications)"],
      "patient_instructions": ["Incision care: keep clean and dry. No soaking in baths/pools. Log-roll technique to get in/out of bed to avoid twisting. Avoid bending at the waist and lifting anything heavier than 5-10 lbs for the first 6 weeks. Begin walking as tolerated; it is the best exercise. Attend prescribed physical therapy. Report signs of infection (fever, redness/drainage from incision) or new/worsening neurological symptoms (leg weakness, bowel/bladder incontinence) immediately."]
    },
    {
      "procedure_name": "Total Abdominal Hysterectomy with Bilateral Salpingo-Oophorectomy",
      "cpt_code": "58150",
      "icd10_pcs_code": "0UT94ZZ",
      "category": "Gynecology",
      "description": "A major surgical procedure to remove the uterus (hysterectomy) through an abdominal incision, along with both fallopian tubes (salpingectomy) and both ovaries (oophorectomy). This is typically performed via a Pfannenstiel incision (a low transverse 'bikini line' incision) or, less commonly, a vertical midline incision. It is a definitive treatment for various gynecological conditions and provides surgical menopause if the ovaries are removed in a pre-menopausal woman.",
      "indications": ["Symptomatic Uterine Leiomyomas (Fibroids) causing bleeding, pain, or bulk symptoms", "Endometriosis refractory to medical management", "Gynecologic cancers (endometrial, ovarian, cervical)", "Pelvic organ prolapse", "Chronic pelvic pain of uterine origin", "Adenomyosis", "Prophylactic risk reduction in patients with BRCA mutations"],
      "contraindications": ["Desire for future fertility", "Medical instability for major surgery", "Placenta percreta or other conditions where an alternative approach (e.g., interventional radiology) is preferred"],
      "technique": "Open abdominal surgery. The uterus is detached from its supporting ligaments, blood vessels (uterine artery) are ligated, and it is separated from the cervix (if supracervical) or the entire uterus and cervix are removed (total hysterectomy). The ovaries and tubes are detached and removed.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-120 minutes",
      "complications": ["Hemorrhage", "Infection (wound, urinary tract)", "Injury to adjacent organs (bladder, ureter, bowel)", "Deep Vein Thrombosis (DVT)", "Adhesion formation", "Early menopause symptoms (if ovaries removed)", "Vaginal cuff dehiscence (if cervix removed)"],
      "recovery_time": "Inpatient: 2-4 days. Full recovery: 6-8 weeks. No heavy lifting or intercourse for 6-8 weeks.",
      "success_rate": "High success rate (>95%) for resolving the primary condition (e.g., bleeding from fibroids).",
      "alternative_procedures": ["Laparoscopic or Robotic-Assisted Hysterectomy", "Vaginal Hysterectomy", "Uterine Artery Embolization (for fibroids)", "Myomectomy (for fibroids, preserves uterus)", "Medical management (hormonal therapy for endometriosis/fibroids)"],
      "patient_instructions": ["Incision care as directed. No tampons, douching, or sexual intercourse for 6-8 weeks. Avoid heavy lifting (>10 lbs) and strenuous activity for 6 weeks. Expect vaginal bleeding/spotting for 1-2 weeks. Walk frequently to prevent blood clots. Report fever >100.4°F, severe abdominal pain, heavy vaginal bleeding, or signs of a leg clot (calf pain, redness, swelling) immediately. Discuss management of surgical menopausal symptoms (hot flashes, vaginal dryness) with your doctor."]
    },
    {
      "procedure_name": "Robotic-Assisted Radical Prostatectomy",
      "cpt_code": "55866",
      "icd10_pcs_code": "0VT08ZZ",
      "category": "Urology",
      "description": "A minimally invasive surgical procedure to remove the entire prostate gland and seminal vesicles for the treatment of localized prostate cancer. Utilizing the da Vinci Surgical System, the surgeon operates from a console, controlling robotic arms that hold miniature instruments and a high-definition 3D camera. This technology allows for enhanced precision, magnification, and dexterity in the confined space of the pelvis, facilitating nerve-sparing techniques that can help preserve urinary continence and erectile function.",
      "indications": ["Localized Prostate Cancer (low to intermediate risk)", "Selected cases of high-risk localized prostate cancer", "Failed primary radiation therapy"],
      "contraindications": ["Metastatic prostate cancer", "Medical comorbidities making extended anesthesia high-risk", "Prior complex pelvic surgery creating dense adhesions"],
      "technique": "Minimally invasive laparoscopy with robotic assistance. Typically performed transperitoneally. The prostate is dissected free, with careful preservation of the neurovascular bundles if possible, and the bladder neck is reconstructed to the urethra (vesicourethral anastomosis).",
      "anesthesia_type": "General anesthesia",
      "duration": "2-4 hours",
      "complications": ["Erectile Dysfunction", "Urinary Incontinence (stress or urge)", "Bladder neck contracture", "Rectal injury (rare)", "Lymphocele (if lymph node dissection performed)", "Blood loss requiring transfusion"],
      "recovery_time": "Inpatient: 1-2 days. Urinary catheter remains for 5-14 days. Return to light activities: 2-3 weeks. Full recovery: 6-8 weeks. Recovery of continence and erectile function can take 6-24 months.",
      "success_rate": "High oncologic success with 10-year cancer control >90% for low-risk disease. Continence rates: >90%. Potency rates vary widely (40-80%) based on age, pre-op function, and nerve-sparing success.",
      "alternative_procedures": ["Active Surveillance", "Radiation Therapy (External Beam or Brachytherapy)", "Cryotherapy", "High-Intensity Focused Ultrasound (HIFU)", "Open Radical Retropubic Prostatectomy"],
      "patient_instructions": ["Manage the urinary catheter; keep the bag below bladder level and clean the catheter site. Avoid strenuous activity and heavy lifting for 6 weeks. Perform Kegel exercises regularly to improve urinary control. Do not drive while the catheter is in place. Understand that incontinence and erectile dysfunction are common initially but often improve with time. Follow up for regular PSA checks to monitor for cancer recurrence."]
    },
    {
      "procedure_name": "Functional Endoscopic Sinus Surgery",
      "cpt_code": "31256",
      "icd10_pcs_code": "09BQ8ZZ",
      "category": "Otolaryngology (ENT)",
      "description": "A minimally invasive procedure performed entirely through the nostrils using an endoscope to visualize and access the paranasal sinuses. The goal is to restore normal sinus ventilation and drainage by removing obstructive tissues (diseased sinus mucosa, polyps) and enlarging the natural drainage pathways (ostiomeatal complex). No external incisions are made. It is primarily used to treat chronic sinusitis that has not responded to maximum medical therapy.",
      "indications": ["Chronic Rhinosinusitis with or without Nasal Polyps refractory to medical management", "Recurrent Acute Sinusitis", "Mucoceles", "Benign sinonasal tumors (e.g., inverted papilloma)", "Orbital or optic nerve decompression", "CSF leak repair", "Exposure for pituitary surgery"],
      "contraindications": ["Uncorrectable bleeding disorder", "Medical instability for general anesthesia", "Small child with underdeveloped sinuses"],
      "technique": "Endoscopic visualization. Use of micro-debriders, forceps, and balloons to open and clear the ethmoid, maxillary, frontal, and sphenoid sinuses.",
      "anesthesia_type": "General anesthesia",
      "duration": "60-120 minutes",
      "complications": ["Bleeding", "Orbital injury (hematoma, extraocular muscle injury, blindness <0.1%)", "CSF Leak", "Epiphora (tearing) from nasolacrimal duct injury", "Synechiae (scar tissue) formation", "Recurrence of disease", "Altered sense of smell"],
      "recovery_time": "Outpatient or 23-hour observation. Significant nasal congestion/crusting for 1-3 weeks. Full mucosal healing: 4-6 weeks.",
      "success_rate": "85-90% success rate in significantly improving symptoms of chronic sinusitis.",
      "alternative_procedures": ["Continued medical therapy (nasal steroids, saline irrigations, antibiotics)", "Balloon Sinuplasty (limited applications)", "External/open sinus procedures (e.g., Caldwell-Luc, frontal sinus obliteration - now rare)"],
      "patient_instructions": ["SALINE IRRIGATIONS are crucial. Begin frequent irrigations as directed by your surgeon (often starting 24-48 hours post-op) to clear debris and blood clots and promote healing. Avoid blowing your nose forcefully for 2 weeks. Sneeze with your mouth open. Avoid strenuous activity and heavy lifting for 2 weeks. Expect bloody drainage and congestion. Attend all post-operative debridement appointments. Report severe bleeding, sharp eye pain, vision changes, or clear watery drainage from the nose (could be CSF leak) immediately."]
    },
    {
      "procedure_name": "Laparoscopic Appendectomy",
      "cpt_code": "44970",
      "icd10_pcs_code": "0DTJ4ZZ",
      "category": "General Surgery",
      "description": "The minimally invasive surgical standard for removing an inflamed or infected appendix (acute appendicitis). Three to four small incisions are made in the abdomen. A laparoscope is inserted to visualize the abdominal cavity. The appendix is identified, its mesentery (blood supply) is divided with a energy device, the appendix is stapled off at its base, and then it is removed through one of the ports, often placed in a specimen bag to prevent contamination. Laparoscopy allows for better visualization of the entire abdomen to rule out other pathology.",
      "indications": ["Acute Appendicitis", "Appendiceal Abscess (sometimes after drainage)", "Appendiceal tumor (e.g., carcinoid) found incidentally"],
      "contraindications": ["Generalized peritonitis with hemodynamic instability", "Dense adhesions from multiple previous surgeries", "Late-stage pregnancy (relative)", "Inability to tolerate pneumoperitoneum"],
      "technique": "Minimally invasive laparoscopy. The appendix is mobilized, its vascular pedicle is ligated, the base is transected, and it is removed.",
      "anesthesia_type": "General anesthesia",
      "duration": "30-60 minutes",
      "complications": ["Intra-abdominal abscess (more common in perforated appendicitis)", "Wound infection", "Bleeding", "Ileus", "Port-site hernia", "Stump appendicitis (very rare)"],
      "recovery_time": "Inpatient: 23 hours to 2 days. Return to normal activities: 1-2 weeks. Full recovery: 2-3 weeks.",
      "success_rate": ">99%. Conversion to open procedure occurs in <5% of cases, often for complex inflammation or adhesions.",
      "alternative_procedures": ["Open Appendectomy", "Non-operative management with IV antibiotics for uncomplicated appendicitis (may have higher recurrence rate)", "Percutaneous drainage of appendiceal abscess followed by interval appendectomy"],
      "patient_instructions": ["Diet: Advance from clear liquids to regular diet as tolerated. Keep incision sites clean and dry. Expect some shoulder tip pain from residual CO2 gas for 24-48 hours. Walk daily. Avoid heavy lifting for 4-6 weeks. Report fever, worsening abdominal pain, nausea/vomiting, or redness/drainage from incisions."]
    }
  ]
}
  
